import ElecElements.Components;

public class Main {
    public static void main(String[] args) {
        System.out.println("Hello");

        Components cmps = new Components();

        //Пока не пройдана курс по чтению данных из файла, будум делать так:
        String[] cmp_arr_str = {
                "Конденсатор 0,1 мкФ 50В, 0805, X7R",
                "Конденсатор 0,47 мкФ 25В, 0603, X7R ",
                "Конденсатор 0,68 мкФ 50В, 0603, X7R ",
                "Конденсатор 1 мкФ 16В, 0402, X5R ",
                "Конденсатор 5,6 пФ 50В, 0402, C0G ",
                "Конденсатор выводной 150 мкФ, 100В, 8х50",
                "Конденсатор выводной 1500 мкФ 35В, 20%",
                "Конденсатор керамический 30 пФ 2% 50B, 0603, NP0 ",
                "Конденсатор керамический 330 мкФ 4В, 20%, 1210, X5R ",
                "Резистор 3 кОм, 0603, 5% ",
                "Резистор 0 Ом, 0402, 5% 0,63 Вт ",
                "Резистор 10 кОм, 0402, 5% ",
                "Резистор 10 кОм, 0603, 1% ",
                "Резистор 10 кОм, 0603, 0,1% ",
                "Резистор 10 Ом, 0603, 5% 0,1 Вт ",
                "Резистор 110 Ом, 1206, 5% ",
                "Резистор 15 Ом, 0805, 5% ",
                "Резистор 3,3 Ом, 1%, корпус ТО-220, 50Вт",
                "Резистор 3,9 МОм, 1206, 1% (1206)",
                "Транзистор AFT27S010NT1",
                "Транзистор BC817-40",
                "Транзистор BC847B",
                "Транзистор BC857B" };


        for(String str: cmp_arr_str) {
            cmps.addNewComponents(str);
        }

        cmps.printComponents();
    }
}
